chrisjenson/Projects/PSOC_C_AlarmClockUsingInterrupts/srcs/Design01.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "LCD.h"
#include "SW_aliases.h"
#include "SW.h"
#include "Seg_aliases.h"
#include "Com_aliases.h"
#include "Driver.h"
#include "Driver1.h"
#include "Seg_1_aliases.h"
#include "Com_1_aliases.h"
#include "PWM_1.h"
#include "Clock_1.h"
#include "Pin_1_aliases.h"
#include "Pin_1.h"
#include "isr_2.h"
#include "isr_1.h"
#include "LCD_LCDPort_aliases.h"
#include "LCD_LCDPort.h"
#include "Driver_ClkInternal.h"
#include "Driver_Seg_Driver_L.h"
#include "Driver_Com_Driver.h"
#include "Driver_DMA_Com_dma.h"
#include "Driver_DMA_Seg_dma.h"
#include "Driver1_ClkInternal.h"
#include "Driver1_Seg_Driver_L.h"
#include "Driver1_Com_Driver.h"
#include "Driver1_DMA_Com_dma.h"
#include "Driver1_DMA_Seg_dma.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

